EVENTS/IsolatedBuildingCFD/TemplateCaseDictionary/0/nSurfaceLayers
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      nSurfaceLayers;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    ground
    {
        type            fixedValue;
        value           uniform 0;
    }
    top
    {
        type            symmetry;
    }
    front
    {
        type            symmetry;
    }
    back
    {
        type            symmetry;
    }
    building
    {
        type            fixedValue;
        value           uniform 5;
    }
}


// ************************************************************************* //
