EVENTS/IsolatedBuildingCFD/TemplateCaseDictionary/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.0000;

boundaryField
{
    inlet
    {
	 type 	 zeroGradient;
    }

    outlet
    {
	 type 	  uniformFixedValue;
	 uniformValue 	 constant 0.0000;
    }

    ground 
    {
	 type 	 zeroGradient;
    }
    
    top    
    {
	 type 	 symmetry;
    }

    front    
    {
	 type 	 symmetry;
    }
    
    back    
    {
	 type 	 symmetry;
    }
    
    building 
    {
	 type  	 zeroGradient;
    }
}

// ************************************************************************* //
