EVENTS/IsolatedBuildingCFD/TemplateCaseDictionary/constant/simCenter/output/windProfiles.txt
5.000000e-03 7.757498e+00 1.893398e-01 7.339702e-01
3.020200e-02 8.455598e+00 1.717451e-01 7.698311e-01
5.540400e-02 8.455598e+00 1.717451e-01 7.698311e-01
8.060600e-02 9.095449e+00 1.589260e-01 8.090262e-01
1.058080e-01 9.647570e+00 1.494037e-01 8.678512e-01
1.310100e-01 1.012172e+01 1.420723e-01 8.739168e-01
1.562120e-01 1.052705e+01 1.361676e-01 9.179137e-01
1.814140e-01 1.087178e+01 1.311865e-01 9.925487e-01
2.066160e-01 1.116371e+01 1.268405e-01 1.049916e+00
2.318180e-01 1.140994e+01 1.230064e-01 1.095502e+00
2.570200e-01 1.140994e+01 1.230064e-01 1.095502e+00
2.822220e-01 1.161678e+01 1.197195e-01 1.126976e+00
3.074240e-01 1.179002e+01 1.171905e-01 1.119841e+00
3.326260e-01 1.193491e+01 1.151206e-01 1.200592e+00
3.578280e-01 1.205617e+01 1.133413e-01 1.154277e+00
3.830300e-01 1.215791e+01 1.115484e-01 1.150494e+00
4.082320e-01 1.224388e+01 1.102865e-01 1.265278e+00
4.334340e-01 1.231714e+01 1.080802e-01 1.297923e+00
4.586360e-01 1.238058e+01 1.056622e-01 1.230295e+00
4.838380e-01 1.238058e+01 1.056622e-01 1.230295e+00
5.090400e-01 1.243642e+01 1.031565e-01 1.200254e+00
5.342420e-01 1.248683e+01 1.008479e-01 1.141664e+00
5.594440e-01 1.253329e+01 9.917711e-02 1.104236e+00
5.846460e-01 1.257724e+01 9.844870e-02 1.152576e+00
6.098480e-01 1.261950e+01 9.820469e-02 1.102881e+00
6.350500e-01 1.266100e+01 9.805704e-02 1.121453e+00
6.602520e-01 1.270216e+01 9.780657e-02 1.146998e+00
6.854540e-01 1.270216e+01 9.780657e-02 1.146998e+00
7.106560e-01 1.274336e+01 9.726604e-02 1.130920e+00
7.358580e-01 1.278472e+01 9.640481e-02 1.164161e+00
7.610600e-01 1.282613e+01 9.539420e-02 1.254221e+00
7.862620e-01 1.286750e+01 9.394780e-02 1.100356e+00
8.114640e-01 1.290853e+01 9.253443e-02 1.030897e+00
8.366660e-01 1.294889e+01 9.110417e-02 1.133840e+00
8.618680e-01 1.298814e+01 9.004343e-02 1.127172e+00
8.870700e-01 1.302602e+01 8.933422e-02 1.141425e+00
9.122720e-01 1.302602e+01 8.933422e-02 1.141425e+00
9.374740e-01 1.306207e+01 8.870567e-02 1.066154e+00
9.626760e-01 1.309595e+01 8.853955e-02 1.140059e+00
9.878780e-01 1.312741e+01 8.843767e-02 1.165567e+00
1.013080e+00 1.315626e+01 8.815618e-02 1.118587e+00
1.038282e+00 1.318233e+01 8.724413e-02 1.124611e+00
1.063484e+00 1.320550e+01 8.580663e-02 1.193563e+00
1.088686e+00 1.322571e+01 8.404425e-02 1.192005e+00
1.113888e+00 1.322571e+01 8.404425e-02 1.192005e+00
1.139090e+00 1.324309e+01 8.233888e-02 1.191398e+00
1.164292e+00 1.325754e+01 8.104132e-02 1.139072e+00
1.189494e+00 1.326918e+01 8.011006e-02 1.126738e+00
1.214696e+00 1.327810e+01 7.961333e-02 8.849435e-01
1.239898e+00 1.328435e+01 7.957667e-02 1.138674e+00
1.265101e+00 1.328435e+01 7.957667e-02 1.138674e+00
1.290303e+00 1.328929e+01 7.925950e-02 1.093953e+00
1.315505e+00 1.328834e+01 7.939464e-02 7.629892e-01
1.340707e+00 1.328834e+01 7.939464e-02 7.629892e-01
1.365909e+00 1.328834e+01 7.939464e-02 7.629892e-01
1.391111e+00 1.327984e+01 7.933029e-02 7.402799e-01
1.416313e+00 1.327984e+01 7.933029e-02 7.402799e-01
1.441515e+00 1.326529e+01 7.830192e-02 7.399265e-01
1.466717e+00 1.326529e+01 7.830192e-02 7.399265e-01
1.491919e+00 1.324589e+01 7.823296e-02 7.690420e-01
1.517121e+00 1.324589e+01 7.823296e-02 7.690420e-01
1.542323e+00 1.324589e+01 7.823296e-02 7.690420e-01
1.567525e+00 1.322249e+01 7.810327e-02 7.177779e-01
1.592727e+00 1.322249e+01 7.810327e-02 7.177779e-01
1.617929e+00 1.319551e+01 7.736843e-02 6.676607e-01
1.643131e+00 1.319551e+01 7.736843e-02 6.676607e-01
1.668333e+00 1.316471e+01 1.394270e-01 2.886701e+00
1.693535e+00 1.316471e+01 1.394270e-01 2.886701e+00
1.718737e+00 1.316471e+01 1.394270e-01 2.886701e+00
1.743939e+00 1.316463e+01 1.404003e-01 2.865452e+00
1.769141e+00 1.310860e+01 1.438917e-01 2.672305e+00
1.794343e+00 1.310860e+01 1.438917e-01 2.672305e+00
1.819545e+00 1.310860e+01 1.438917e-01 2.672305e+00
1.844747e+00 1.304983e+01 1.466196e-01 2.643645e+00
1.869949e+00 1.304983e+01 1.466196e-01 2.643645e+00
1.895151e+00 1.304983e+01 1.466196e-01 2.643645e+00
1.920353e+00 1.304983e+01 1.466196e-01 2.643645e+00
1.945555e+00 1.304992e+01 1.488948e-01 2.659768e+00
1.970757e+00 1.304992e+01 1.488948e-01 2.659768e+00
1.995959e+00 1.304992e+01 1.488948e-01 2.659768e+00
2.021161e+00 1.305000e+01 1.471344e-01 2.716988e+00
2.046363e+00 1.305000e+01 1.471344e-01 2.716988e+00
2.071565e+00 1.304990e+01 1.499681e-01 2.657702e+00
2.096767e+00 1.304990e+01 1.499681e-01 2.657702e+00
2.121969e+00 1.304990e+01 1.499681e-01 2.657702e+00
2.147171e+00 1.304990e+01 1.499681e-01 2.657702e+00
2.172373e+00 1.304986e+01 1.550709e-01 2.666667e+00
2.197575e+00 1.304986e+01 1.550709e-01 2.666667e+00
2.222777e+00 1.304986e+01 1.550709e-01 2.666667e+00
2.247979e+00 1.304986e+01 1.550709e-01 2.666667e+00
2.273181e+00 1.304986e+01 1.550709e-01 2.666667e+00
2.298383e+00 1.304986e+01 1.550709e-01 2.666667e+00
2.323585e+00 1.304986e+01 1.550709e-01 2.666667e+00
2.348787e+00 1.304986e+01 1.550709e-01 2.666667e+00
2.373989e+00 1.304986e+01 1.550709e-01 2.666667e+00
2.399191e+00 1.304986e+01 1.550709e-01 2.666667e+00
2.424393e+00 1.304986e+01 1.550709e-01 2.666667e+00
2.449595e+00 1.304986e+01 1.550709e-01 2.666667e+00
2.474797e+00 1.304986e+01 1.550709e-01 2.666667e+00
2.499999e+00 1.304986e+01 1.550709e-01 2.666667e+00
