EVENTS/IsolatedBuildingCFD/TemplateCaseDictionary/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.05;
        smoother        GaussSeidel;
    }

    Phi
    {
        //$p
	solver          GAMG;
        tolerance       1e-04;
        relTol          0.1;
        smoother        GaussSeidel;
    }
    
    k
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }

    epsilon
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }

    relaxationFactors
    {
	equations
	{ 
	  "Phi.*"    	0.75;
	}
    }

    pFinal
    {
        $p;
        smoother        DICGaussSeidel;
        relTol          0;
    }

    "(U|k|nuTilda|Rwall)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    "(U|k|nuTilda|Rwall)Final"
    {
        $U;
        tolerance       1e-05;
        relTol          0;
    }
    
}

SIMPLE
{
    nNonOrthogonalCorrectors 	1;
    pRefCell        1001;
    pRefValue       0;
    
    residualControl
    {
        p               1e-4;
        U               1e-4;
        "(k|omega|epsilon)" 1e-4;
    }
}

PIMPLE
{
    nOuterCorrectors 	1;
    nCorrectors 	2;
    nNonOrthogonalCorrectors 	1;
    pRefCell	1001;
    pRefValue	0;
}

PISO
{
    nCorrectors 	2;
    nNonOrthogonalCorrectors 	1;
    pRefCell	1001;
    pRefValue	0;
}

potentialFlow
{
    nNonOrthogonalCorrectors 1;
}
// ************************************************************************* //
